package com.vrcvp.cloudvision.xfyun;

/**
 * 讯飞语义通用服务类型
 * Created by yinglovezhuzhu@gmail.com on 2016/11/15.
 */

public enum XFService {
    /** 应用 打开应用 如：打开 QQ **/
    app,
    /** 百科 百科知识查询 如：快乐大本营 **/
    baike,
    /** 计算器 数字计算器 如： 10的平方是多少 **/
    calc,
    /** 菜谱 菜谱 如：红烧肉怎么做 **/
    cookbook,
    /**  日期 日期假日查询 如：母亲节是哪天**/
    datetime,
    /** 社区问答 社区知识问答 如：世界上最大的国家 **/
    faq,
    /** 航班查询 查询航班信息 如： 查询从广州到北京的航班 **/
    flight,
    /** 酒店查询 查询酒店信息 如： 我要订一个明天广州天河区汉庭酒店的房间 **/
    hotel,
    /** 地图导航 查询某地点的位置或两地之间的路线， 如： 中国移动全球通大厦怎么走 **/
    map,
    /** 播放歌曲 如： 播放刘德华的忘情水 **/
    music,
    /** 电台查询 电台查询 如： 我要听北京音乐台 **/
    radio, 
    /** 餐馆查询 餐馆查询 如：中国移动全球通大厦附近有火锅店吗 **/
    restaurant,
    /** 提醒 提醒功能 如： 提醒我下午 3 点有会 **/
    schedule,
    /** 股票查询 提醒查询 如：中国移动股价多少 **/
    stock,
    /** 火车查询 火车查询 如： 查询明天从广州到北京的火车 **/
    train,
    /** 翻译 翻译 如： 祝大家万事如意用英语怎么说 **/
    translation,
    /** 电视节目预告 电视节目详情查询 如：广东卫视播什么电视 **/
    tv,
    /** 视频点播 视频点播 如：我要看电影中国合伙人 **/
    video,
    /** 天气查询 天气查询 如： 明天广州什么天气 **/
    weather,
    /** 网页搜索 网页搜索 **/
    websearch,

}
